# IEntryPoint Interface

---
The interface supporting Document and Application level entry point classes for macros.
**Namespace:** Autodesk.Revit.DB.Macros**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

    public interface IEntryPoint

    Public Interface IEntryPoint

    public interface class IEntryPoint

    type IEntryPoint = interface end
The IEntryPoint type exposes the following members.
| Name| Description
---|---|---
| AddinFolder|
Top
| Name| Description
---|---|---
| FinishInitialization|
| Initialize|
| OnShutdown|
Top
#### Reference
Autodesk.Revit.DB.Macros Namespace